
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/73670)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-05T20:00:18Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "e4jnta" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1709668783048" -> "1709769687321"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "e4jnta" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
        id                             = "SendGridData-Prod-ApiGateway-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:60" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:60/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "60" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                           = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"fefe6572-cae5-4b18-821c-90c285890493","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":260,"Program":"tfcmt","SHA1":"72e863d1f66c573fb3953a237f538c5bade5facd","Target":"sendgrid-data-cdk","Vars":{}} -->